module Roles
  module Neutrals
    class Assassin < Neutral

      ASSASSIN_TARGETS_TO_KILL = 3

      def win_condition
        dead_players = game_session.players.dead
        Badges::AssassinTag.where(player: dead_players).count >= ASSASSIN_TARGETS_TO_KILL
      end
    end
  end
end

# Ассасин - нейтрал, проснувшись ночью знакомства выбирает себе три цели (из числа сторон, не ролей).
# (выбрав трижды мафию должен будет убить трех мафии, выбрал двух мирных и нейтрала должен будет убить двух мирных и одного нейтрала), ночью указывает на игрока, затем на сторону за которую тот играет, указав верно, убивает его, если ошибся, то теряет возможность проверять следующей ночью.
# Побеждает убив все свои цели. (Если игроков стороны выбранной в начале не остаётся, цель смещается на самую многочисленную сторону).
