module Roles
  module Neutrals
    class Scammer < Neutral

      def win_condition

      end
    end
  end
end

# Жесть какая :cry:
# Аферист - нейтрал, в ночь приветствия выбирает любую, ещё не присутствующую в игре нейтральную роль, получает весь её функционал. На всех первых проверках открывается как Аферист, на второй проверке откроется его взятая роль. Если в ходе игры, кто-либо обратится к нему напрямую и назовет верно его взятую роль, погибает. Если человек попытавшийся назвать афериста не угадывает с взятой ролью или даже самим аферистом, он теряет ночные функции, а также высказывание и голосование на один ход.
