module Roles
  module Mafias
    class Seductress < Mafia
      def move_order
        Constants::MOVE_ORDER[:MAFIA]
      end

      def use_ability
        # ПОКА НЕ ПОНЯТНО КАК РБАОТАЕТ
      end
    end
  end
end

# Соблазнительница - каждую ночь выбирает одну из ролей игроков, и получает способности роли до своего следующего ночного действия. Каждая роль может быть выбрана лишь единожды за игру. В ситуации когда все роли  в игре уже были выбраны, оставшиеся роли вновь можно выбрать по одному разу.
